README.org
#+TITLE: beast-org

* Body Beast meets Org-Mode

Capture [[http://www.beachbody.com/product/fitness_programs/body-beast-workout.do][Body Beast]] workout results and create graphs

See [[file:statistics.org][statistics.org]] (plain org file) , [[file:statistics.md][statistics.md]] (markdown with graphics), [[file:statistics.html][statistics.html]] (styled with [[https://github.com/fniessen/org-html-themes][org-html-themes]])

** Capture Templates 

[[file:statistics.org][statistics.org]] defines a couple of Capture Templates for the Bulk Phase. 

Workouts are captured in file =beast-org-file= ([[file:workouts-example.org][workouts-example.org]])

** Emacs-Lisp

see [[file:src/beast-org.el][beast-org.el]]

** R 

R needs zoo, ggplot2 and reshape2

#+BEGIN_SRC R
install.packages("zoo")
install.packages("ggplot2")
install.packages("reshape")
#+END_SRC

** Batch Export

*** HTML 

#+BEGIN_SRC sh
emacs -l init.el statistics.org --batch -f org-html-export-to-html --kill
#+END_SRC

*** Markdown 

Needs ox-md: =(require 'ox-md)= 

#+BEGIN_SRC sh
emacs -l init.el statistics.org --batch -f org-md-export-to-markdown --kill
#+END_SRC





